wei134102/OpenFIRE-Firmware-ESP32/lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  // ================= STRUTTURA PER STATISTICHE CANALE =================
  typedef struct {
    uint16_t networks;  // numero di AP rilevati sul canale
    float avgRSSI;      // RSSI medio dei AP
    int8_t maxRSSI;     // RSSI massimo rilevato
    uint32_t packets;   // pacchetti catturati in sniffing
    float noise;        // stima rumore sul canale
    float score;        // punteggio combinato del canale
  } ChannelStats;
  
  ChannelStats channelStats[14];  // array canali 1-13 (indice 0 non usato)
  memset(channelStats, 0, sizeof(channelStats));
  g_packetCounter = 0;
  g_sniffing = false;
  for (int i = 0; i < 14; i++) channelStats[i].maxRSSI = -128;

  // ================= FASE 1: SCAN RETI WiFi =================
  WiFi.mode(WIFI_STA);      // setta modalità station
  WiFi.disconnect();        // disconnetti eventuali connessioni
  vTaskDelay(pdMS_TO_TICKS(100)); // stabilizzazione radio

  // scan sincrono: include reti nascoste, scan attivo, max 120 ms per canale
  int n = WiFi.scanNetworks(false, true, false, 300UL /*120*/, 0);
  if (n < 0) n = 0; // gestione errore scan

  // processa risultati scan
  if (n > 0) {
    for (int i = 0; i < n; i++) {
      int ch = WiFi.channel(i);
      int rssi = WiFi.RSSI(i);
      if (ch >= 1 && ch <= 13) {
        if (channelStats[ch].networks < 65535) channelStats[ch].networks++;
        channelStats[ch].avgRSSI += rssi;
        if (rssi > channelStats[ch].maxRSSI) channelStats[ch].maxRSSI = (int8_t)rssi;
      }
    }
    // calcola RSSI medio per canale
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks > 0)
        channelStats[ch].avgRSSI /= channelStats[ch].networks;
      else
        channelStats[ch].maxRSSI = -100; // canale vuoto = RSSI minimo
    }
  }
  WiFi.scanDelete();           // libera memoria scan
  vTaskDelay(pdMS_TO_TICKS(50)); // breve pausa per stabilità

  // ================= FASE 2: SNIFF TRAFFICO E NOISE =================
  // promiscous mode: permette di contare pacchetti sul canale
  esp_err_t err = ESP_OK;
  if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_INIT) {
    // se non parte promiscuous mode, fallback: solo scan AP
    int bestCh = 1;
    uint16_t minNets = 65535;
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks < minNets) {
        minNets = channelStats[ch].networks;
        bestCh = ch;
      }
    }
    return bestCh;
  }

  vTaskDelay(pdMS_TO_TICKS(50));
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_promiscuous_rx_cb(&promiscuousCallback);

  for (int ch = 1; ch <= 13; ch++) {
    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE); // switch canale
    vTaskDelay(pdMS_TO_TICKS(50)); // stabilizzazione canale

    // --- Misurazione traffico: conteggio pacchetti ---
    g_packetCounter = 0;
    g_sniffing = true;
    uint32_t startCount = g_packetCounter;
    vTaskDelay(pdMS_TO_TICKS(400)); // periodo sniff 400 ms
    channelStats[ch].packets = g_packetCounter - startCount;

    // --- Misurazione Noise Floor ---
    int32_t noiseSum = 0;
    const int samples = 15; // 15 campioni per media
    for (int i = 0; i < samples; i++) {
      uint32_t start = g_packetCounter;
      vTaskDelay(pdMS_TO_TICKS(17));
      uint32_t activity = g_packetCounter - start;
      if (activity > 50) activity = 50; // clamp
      noiseSum += -95 + (activity * 3); // formula stima rumore
    }
    channelStats[ch].noise = noiseSum / (float)samples;
    // clamp valori realistici
    if (channelStats[ch].noise > -50) channelStats[ch].noise = -50;
    if (channelStats[ch].noise < -100) channelStats[ch].noise = -100;
  }

  g_sniffing = false;
  esp_wifi_set_promiscuous(false);
  esp_wifi_set_promiscuous_rx_cb(NULL);

  // ================= FASE 3: CALCOLO SCORE =================
  // pesi ottimizzati per ESP-NOW
  const float wNet   = 1.0f; //0.05625f;
  const float wRSSI  = 0.30f;
  const float wPkt   = 0.375f;
  const float wNoise = 0.10f;

  for (int ch = 1; ch <= 13; ch++) {
    float sNet = channelStats[ch].networks * 100.0 * wNet; // più reti = peggio
    float sRSSI = 0;
    if (channelStats[ch].maxRSSI > -100) {
      int rssiMapped = constrain(channelStats[ch].maxRSSI, -100, -30);
      sRSSI = map(rssiMapped, -100, -30, 0, 100) * wRSSI; // RSSI massimo
    }
    float sPkt = (channelStats[ch].packets / 10.0) * wPkt; // traffico pacchetti
    int noiseMapped = constrain((int)channelStats[ch].noise, -100, -50);
    float sNoise = map(noiseMapped, -100, -50, 0, 100) * wNoise; // rumore
    channelStats[ch].score = sNet + sRSSI + sPkt + sNoise; // score base
  }

  // --- Penalità sovrapposizione ±2 canali ---
  float finalScores[14];
  for (int ch = 1; ch <= 13; ch++) {
    finalScores[ch] = channelStats[ch].score;
    if (ch > 1) finalScores[ch] += channelStats[ch-1].score * 0.35; // adiacente -1
    if (ch > 2) finalScores[ch] += channelStats[ch-2].score * 0.15; // adiacente -2
    if (ch < 13) finalScores[ch] += channelStats[ch+1].score * 0.35; // adiacente +1
    if (ch < 12) finalScores[ch] += channelStats[ch+2].score * 0.15; // adiacente +2
  }

  // ================= FASE 4: SELEZIONE MIGLIOR CANALE =================
  int bestCh = 1;
  float minScore = 999999.0;
  for (int ch = 1; ch <= 13; ch++) {
    if (finalScores[ch] < minScore) {
      minScore = finalScores[ch];
      bestCh = ch;
    }
  }

  // ================= PULIZIA FINALE =================
  vTaskDelay(pdMS_TO_TICKS(50));
  g_packetCounter = 0;
  g_sniffing = false;
  vTaskDelay(pdMS_TO_TICKS(50));

  return bestCh;
}

#endif // commento

// ===============================================================
// ESP-NOW OPTIMAL CHANNEL FINDER - VERSIONE PERFETTA
// Tempo totale: ~14 secondi | Accuratezza: massima
// ===============================================================

// ================= VARIABILI GLOBALI PER CALLBACK =================
static volatile uint32_t g_packetCounter = 0;
static volatile bool g_sniffing = false;

// ================= CALLBACK PROMISCUOUS MODE =================
void IRAM_ATTR promiscuousCallback(void *buf, wifi_promiscuous_pkt_type_t type) {
  if (!g_sniffing) return;
  g_packetCounter = g_packetCounter + 1;
}

// ================= FUNZIONE PRINCIPALE =================
int findBestChannel() {
  
