wei134102/OpenFIRE-Firmware-ESP32/lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  // ================= STRUTTURA PER STATISTICHE CANALE =================
  typedef struct {
    uint16_t networks;   // Numero di AP rilevati
    float avgRSSI;       // RSSI medio degli AP
    int8_t maxRSSI;      // RSSI massimo (interferenza più forte)
    uint32_t packets;    // Pacchetti catturati in 600ms
    float noise;         // Stima noise floor
    float score;         // Score base del canale
  } ChannelStats;
  
  ChannelStats channelStats[14];
  memset(channelStats, 0, sizeof(channelStats));
  g_packetCounter = 0;
  g_sniffing = false;
  for (int i = 0; i < 14; i++) channelStats[i].maxRSSI = -128;

  // ================= FASE 1: SCAN RETI WiFi =================
  // Tempo: ~2 secondi (150ms × 13 canali)
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  vTaskDelay(pdMS_TO_TICKS(100));

  // Scan ottimizzato: 150ms per canale cattura tutti i beacon
  // (beacon interval tipico: 100ms)
  int n = WiFi.scanNetworks(false, true, false, 150UL, 0);
  if (n < 0) n = 0;

  if (n > 0) {
    for (int i = 0; i < n; i++) {
      int ch = WiFi.channel(i);
      int rssi = WiFi.RSSI(i);
      if (ch >= 1 && ch <= 13) {
        if (channelStats[ch].networks < 65535) channelStats[ch].networks++;
        channelStats[ch].avgRSSI += rssi;
        if (rssi > channelStats[ch].maxRSSI) {
          channelStats[ch].maxRSSI = (int8_t)rssi;
        }
      }
    }
    
    // Calcola RSSI medio
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks > 0) {
        channelStats[ch].avgRSSI /= channelStats[ch].networks;
      } else {
        channelStats[ch].maxRSSI = -100; // Canale vuoto
      }
    }
  }
  
  WiFi.scanDelete();
  vTaskDelay(pdMS_TO_TICKS(50));

  // ================= FASE 2: SNIFF TRAFFICO E NOISE =================
  // Tempo: ~12 secondi (920ms × 13 canali)
  esp_err_t err = ESP_OK;
  if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_INIT) {
    // Fallback: solo scan AP se promiscuous mode non disponibile
    int bestCh = 1;
    uint16_t minNets = 65535;
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks < minNets) {
        minNets = channelStats[ch].networks;
        bestCh = ch;
      }
    }
    return bestCh;
  }

  vTaskDelay(pdMS_TO_TICKS(50));
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_promiscuous_rx_cb(&promiscuousCallback);

  for (int ch = 1; ch <= 13; ch++) {
    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
    vTaskDelay(pdMS_TO_TICKS(70)); // Stabilizzazione radio
    
    // --- Misurazione traffico: 600ms cattura pattern completi ---
    // Include: beacon (100ms), data burst, retry packets
    g_packetCounter = 0;
    g_sniffing = true;
    uint32_t startCount = g_packetCounter;
    vTaskDelay(pdMS_TO_TICKS(600));
    uint32_t endCount = g_packetCounter;
    channelStats[ch].packets = endCount - startCount;
    
    // --- Misurazione Noise Floor: 15 campioni per media stabile ---
    int32_t noiseSum = 0;
    const int samples = 15;
    for (int i = 0; i < samples; i++) {
      uint32_t start = g_packetCounter;
      vTaskDelay(pdMS_TO_TICKS(17)); // Campionamento 17ms (totale 255ms)
      uint32_t activity = g_packetCounter - start;
      
      // Formula noise migliorata: scala logaritmica
      if (activity == 0) {
        noiseSum += -100; // Silenzio completo
      } else if (activity <= 3) {
        noiseSum += -95 + (activity * 3);
      } else if (activity <= 10) {
        noiseSum += -86 + (activity - 3) * 2;
      } else if (activity <= 30) {
        noiseSum += -72 + (activity - 10);
      } else {
        noiseSum += -52 + (activity - 30) / 2;
      }
    }
    
    channelStats[ch].noise = noiseSum / (float)samples;
    channelStats[ch].noise = constrain(channelStats[ch].noise, -100, -50);
  }

  g_sniffing = false;
  esp_wifi_set_promiscuous(false);
  esp_wifi_set_promiscuous_rx_cb(NULL);

  // ================= FASE 3: CALCOLO SCORE OTTIMIZZATO =================
  // Pesi basati su analisi empirica e documentazione Espressif
  // 
  // PRIORITÀ PER ESP-NOW:
  // 1. RSSI forte = interferenza diretta che abbassa SNR (KILLER #1)
  // 2. Traffico reale = collisioni pacchetti (KILLER #2)
  // 3. Numero reti = congestione potenziale (moderato)
  // 4. Noise floor = basso impatto (ESP-NOW usa MCS0/802.11b robusto)
  
  const float wRSSI  = 0.40f;  // Interferenza diretta = priorità massima
  const float wPkt   = 0.35f;  // Collisioni reali = molto critico
  const float wNet   = 0.20f;  // Congestione = moderato (scala log)
  const float wNoise = 0.05f;  // Rumore = minimo (modulazione robusta)

  for (int ch = 1; ch <= 13; ch++) {
    
    // --- Score RSSI: interferenza diretta più pericolosa ---
    // AP con segnale forte (-40dBm) vicino = disastro garantito
    // -100dBm (lontano) = 0 punti | -40dBm (vicino) = 40 punti
    float sRSSI = 0;
    if (channelStats[ch].maxRSSI > -100) {
      int rssiMapped = constrain(channelStats[ch].maxRSSI, -100, -30);
      sRSSI = map(rssiMapped, -100, -30, 0, 100) * wRSSI;
    }
    
    // --- Score Pacchetti: traffico reale misurato ---
    // Normalizzato su 600ms: 0 pkt = 0 | 100 pkt = 35 punti
    float sPkt = (channelStats[ch].packets / 10.0) * wPkt;
    if (sPkt > 100 * wPkt) sPkt = 100 * wPkt; // clamp max
    
    // --- Score Reti: scala logaritmica per evitare dominanza ---
    // 0 reti = 0 | 1 rete = 4.2 | 5 reti = 9.2 | 10 reti = 13.8
    float sNet = (channelStats[ch].networks > 0) 
                 ? (log(channelStats[ch].networks + 1) * 20.0) * wNet 
                 : 0;
    
    // --- Score Noise: peso minimo (ESP-NOW resistente) ---
    // -100dBm (silenzio) = 0 | -50dBm (rumoroso) = 5 punti
    int noiseMapped = constrain((int)channelStats[ch].noise, -100, -50);
    float sNoise = map(noiseMapped, -100, -50, 0, 100) * wNoise;
    
    channelStats[ch].score = sRSSI + sPkt + sNet + sNoise;
  }

  // ================= PENALITÀ OVERLAP CANALI ADIACENTI =================
  // WiFi 20MHz: ogni canale si sovrappone con ±4 canali
  // Riferimento: 802.11b usa 22MHz, 802.11g/n usa 20MHz + guardband
  // Canali non-overlapping: 1, 6, 11 (separati di 5 canali)
  //
  // Penalità progressive per simulare overlap reale:
  // ±1: 50% (overlap massimo, circa 75% spettro condiviso)
  // ±2: 35% (overlap significativo, circa 50% spettro)
  // ±3: 20% (overlap moderato, circa 25% spettro)
  // ±4: 10% (overlap minimo, bordi spettro)
  
