wei134102/OpenFIRE-Firmware-ESP32/lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  float finalScores[14];
  for (int ch = 1; ch <= 13; ch++) {
    finalScores[ch] = channelStats[ch].score;
    
    // Penalità overlap completo modello 20MHz
    if (ch > 1) finalScores[ch] += channelStats[ch-1].score * 0.50f;
    if (ch > 2) finalScores[ch] += channelStats[ch-2].score * 0.35f;
    if (ch > 3) finalScores[ch] += channelStats[ch-3].score * 0.20f;
    if (ch > 4) finalScores[ch] += channelStats[ch-4].score * 0.10f;
    
    if (ch < 13) finalScores[ch] += channelStats[ch+1].score * 0.50f;
    if (ch < 12) finalScores[ch] += channelStats[ch+2].score * 0.35f;
    if (ch < 11) finalScores[ch] += channelStats[ch+3].score * 0.20f;
    if (ch < 10) finalScores[ch] += channelStats[ch+4].score * 0.10f;
  
    // Dopo il calcolo finalScores, dare bonus ai canali ideali
    //if (ch == 1 || ch == 6 || ch == 11) {
    //  finalScores[ch] *= 0.92f; // -8% bonus (preferenza)
    //}  
  }

  // ================= FASE 4: SELEZIONE MIGLIOR CANALE =================
  int bestCh = 1;
  float minScore = 999999.0;
  
  for (int ch = 1; ch <= 13; ch++) {
    if (finalScores[ch] < minScore) {
      minScore = finalScores[ch];
      bestCh = ch;
    }
  }

  // ================= DEBUG OUTPUT (opzionale) =================
  #ifdef DEBUG_CHANNEL_SELECTION
  Serial.println("\n========== ESP-NOW CHANNEL ANALYSIS ==========");
  Serial.println("CH | Nets | RSSI | Pkts | Noise | Score  | Final  ");
  Serial.println("---|------|------|------|-------|--------|--------");
  for (int ch = 1; ch <= 13; ch++) {
    char marker = (ch == bestCh) ? '*' : ' ';
    Serial.printf("%c%2d |  %2d  | %4d | %4lu | %5.1f | %6.2f | %6.2f\n",
                  marker, ch,
                  channelStats[ch].networks,
                  channelStats[ch].maxRSSI,
                  channelStats[ch].packets,
                  channelStats[ch].noise,
                  channelStats[ch].score,
                  finalScores[ch]);
  }
  Serial.println("==============================================");
  Serial.printf("BEST CHANNEL: %d (score: %.2f)\n", bestCh, minScore);
  Serial.println("==============================================\n");
  #endif

  // ================= PULIZIA FINALE =================
  vTaskDelay(pdMS_TO_TICKS(50));
  g_packetCounter = 0;
  g_sniffing = false;
  
  return bestCh;
}

// ===============================================================
// USAGE EXAMPLE:
// ===============================================================
// void setup() {
//   Serial.begin(115200);
//   
//   Serial.println("Searching for best ESP-NOW channel...");
//   int channel = findBestChannel();
//   Serial.printf("Selected channel: %d\n", channel);
//   
//   // Inizializza ESP-NOW sul canale scelto
//   WiFi.mode(WIFI_STA);
//   WiFi.disconnect();
//   esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
//   
//   if (esp_now_init() == ESP_OK) {
//     Serial.println("ESP-NOW initialized successfully");
//   }
// }
// ===============================================================
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/*****************************
 *   SERIAL WIRELESS SECTION
 *****************************/

SerialWireless_::operator bool() {
  return true;
}

int SerialWireless_::peek() {
  if (lenBufferSerialRead) {
    return bufferSerialRead[_readerSerialRead];
  }
  return -1;
}

int SerialWireless_::peekBin() {
  if (_readLen) {
    return _queue[_reader];
  }
  return -1;
}

int SerialWireless_::read() {
  if (lenBufferSerialRead) {
    uint8_t ret = bufferSerialRead[_readerSerialRead];
    //lenBufferSerialRead --;
    lenBufferSerialRead = lenBufferSerialRead - 1;
    //_readerSerialRead ++;
    _readerSerialRead = _readerSerialRead + 1;
    if (_readerSerialRead >= FIFO_SIZE_READ_SERIAL) {
      _readerSerialRead -= FIFO_SIZE_READ_SERIAL;
    }
    return ret;
  }
  return -1;  
}

bool SerialWireless_::checkForRxPacket() {
  uint16_t numAvailableBin = _readLen;
  uint8_t dato;
  for (uint16_t i = 0; i<numAvailableBin; i++) {
    dato = (uint8_t) readBin();
    if (dato == START_BYTE) packet.reset(); //resetta inizio pacchetto - // controllo dato .. se è uguale a packet::start_byte .. azzera tutto e fai partire da capo altrimenti
    packet.parse(dato, true);
  }
  return true;
}

int SerialWireless_::readBin() {
  if (_readLen) {
    uint8_t ret = _queue[_reader];
    //_readLen --;
    _readLen = _readLen - 1;
    //_reader ++;
    _reader = _reader + 1;
    if (_reader >= FIFO_SIZE_READ) {
      _reader -= FIFO_SIZE_READ;
    }
    return ret;
  }
  return -1;  
}

int SerialWireless_::available() {
  return lenBufferSerialRead;
}

int SerialWireless_::availableBin() {
  return _readLen;
}

int SerialWireless_::availableForWrite() {
  return FIFO_SIZE_WRITE_SERIAL - lenBufferSerialWrite;
}

int SerialWireless_::availableForWriteBin() {
  return BUFFER_SIZE - _writeLen;
}

// bloccante fino a quando il buffer seriale non è vuoto (non bloccante fino a quando sono stati inviati effettivamente i dati)
void SerialWireless_::flush() {
  esp_timer_stop(timer_handle_serial); // spegni timer
  xSemaphoreTake(mutex_tx_serial, portMAX_DELAY); // prende semaforo / attende finchè è libero
  while (lenBufferSerialWrite) {
    flush_sem();
    taskYIELD(); //yield();
  }
  
  xSemaphoreGive(mutex_tx_serial);  // Rilascio il semaforo dopo la callback
  
}

// decidere se controllare se è vuoto anche il buffer_bin
bool SerialWireless_::flush_sem() { // è bloccante e non esce fino a quando il buffer di uscita è completamente vuoto // in virtual com con TinyUISB non è bloccante .. invia il pacchetto più grande che può e ritorna
  if (lenBufferSerialWrite) {
    if ((BUFFER_SIZE - _writeLen) > (lenBufferSerialWrite + PREAMBLE_SIZE + POSTAMBLE_SIZE)) {
      memcpy(&packet.txBuff[PREAMBLE_SIZE], bufferSerialWrite, lenBufferSerialWrite);
      packet.constructPacket(lenBufferSerialWrite, PACKET_TX::SERIAL_TX);
      writeBin(packet.txBuff, lenBufferSerialWrite + PREAMBLE_SIZE+POSTAMBLE_SIZE);
      lenBufferSerialWrite = 0;
      SendData(); // completata la transizione lasciare solo questo
      return true;
    }
    else SendData();
  }
  return false;
}

void SerialWireless_::flushBin() { // mai usata
  SendData();
}

