wei134102/OpenFIRE-Firmware-ESP32/lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
void SerialWireless_::SendData() {
  if (xSemaphoreTake(tx_sem, 0) == pdTRUE) {
    xSemaphoreTake(mutex_writer_bin, portMAX_DELAY);
    if (_writeLen > 0) {
       SendData_sem();
    } else xSemaphoreGive(tx_sem);
    xSemaphoreGive(mutex_writer_bin);
  }
}

void SerialWireless_::SendData_sem() {
  uint16_t len_tx = _writeLen > ESP_NOW_MAX_DATA_LEN ? ESP_NOW_MAX_DATA_LEN : _writeLen;
  uint16_t bytesToSendEnd = len_tx > (BUFFER_SIZE - readIndex) ? BUFFER_SIZE - readIndex : len_tx;
  memcpy(buffer_espnow, &buffer[readIndex], bytesToSendEnd);
  if (len_tx > bytesToSendEnd) {
    memcpy(&buffer_espnow[bytesToSendEnd], &buffer[0], len_tx - bytesToSendEnd);
  }
  esp_err_t result = esp_now_send(peerAddress, buffer_espnow, len_tx);
  if (result == ESP_OK) { // verificare se esistono casi in cui seppur non risporta ESP_OK vengono trasmessi lo steso
    readIndex += len_tx; 
    if (readIndex >= BUFFER_SIZE) { readIndex -= BUFFER_SIZE; }
    _writeLen -= len_tx;
  }
}

size_t SerialWireless_::write(uint8_t c) {
  return write(&c, 1);
}

size_t SerialWireless_::writeBin(uint8_t c) {
  return writeBin(&c, 1);
}

size_t SerialWireless_::write(const uint8_t *data, size_t len) {
  size_t len_remainer = len;
  size_t pos_remainer = 0;

  xSemaphoreTake(mutex_tx_serial, portMAX_DELAY);
  while (len_remainer > 0) {
    size_t available_space = FIFO_SIZE_WRITE_SERIAL - lenBufferSerialWrite;
    if (available_space >= len_remainer) {
      memcpy(&bufferSerialWrite[lenBufferSerialWrite], &data[pos_remainer], len_remainer);
      if (lenBufferSerialWrite == 0) {
        esp_timer_start_once(timer_handle_serial, TIMER_HANDLE_SERIAL_DURATION_MICROS);
      }
      lenBufferSerialWrite += len_remainer;
      len_remainer = 0;
    } else {
      if (len_remainer == len) esp_timer_stop(timer_handle_serial);
      if (available_space) {
        memcpy(&bufferSerialWrite[lenBufferSerialWrite], &data[pos_remainer], available_space);
        lenBufferSerialWrite = FIFO_SIZE_WRITE_SERIAL;
        pos_remainer += available_space;
        len_remainer -= available_space;
      }
      flush_sem();
    }
    taskYIELD();
  }
  xSemaphoreGive(mutex_tx_serial);
  return len;
}

size_t SerialWireless_::writeBin(const uint8_t *data, size_t len) {
  
  xSemaphoreTake(mutex_writer_bin, portMAX_DELAY);
  
  if ((BUFFER_SIZE - _writeLen) >= len) {
    size_t firstChunk = BUFFER_SIZE - writeIndex;
    if (firstChunk < len) {
      memcpy(&buffer[writeIndex], data, firstChunk);
      writeIndex = len - firstChunk;  
      memcpy(&buffer[0], data + firstChunk, writeIndex);
    }
    else {
      memcpy(&buffer[writeIndex], data, len);
      writeIndex += len;
      if (writeIndex == BUFFER_SIZE) writeIndex = 0;
    }
    _writeLen += len;
    xSemaphoreGive(mutex_writer_bin);
    return len;
  }
  else {
    _overflow_write = true;
    // TODO: gestire overflow
    //Serial.println("Overflow nello scrivere nel BUFFER scrittura");   
    xSemaphoreGive(mutex_writer_bin);
    return 0;
  }
}

void SerialWireless_::SendPacket(const uint8_t *data, const uint8_t &len,const uint8_t &packetID) { 
  /*
  TODO: gestire fifo separate per controllo ??? valutare
  switch (packetID)
  {
  case PACKET_TX::MOUSE_TX:
    // gestire una fifo separata ?
    break;
  case PACKET_TX::KEYBOARD_TX:
    //
    break;
  case PACKET_TX::GAMEPADE_TX:
    //
    break;
  default:
    break;
  }
  */
  if ((BUFFER_SIZE - _writeLen) > (len + PREAMBLE_SIZE + POSTAMBLE_SIZE)) {
    memcpy(&packet.txBuff[PREAMBLE_SIZE], data, len);
    packet.constructPacket(len, packetID);
    writeBin(packet.txBuff, len + PREAMBLE_SIZE + POSTAMBLE_SIZE);
    SendData(); // try_Send
  }
}

void SerialWireless_::write_on_rx_serialBuffer(const uint8_t *data, int len) {
  if ((FIFO_SIZE_READ_SERIAL - lenBufferSerialRead) >= len) {
    size_t firstChunk = FIFO_SIZE_READ_SERIAL - _writerSerialRead;
    if (firstChunk < len) {
      memcpy(&bufferSerialRead[_writerSerialRead], data, firstChunk);
      _writerSerialRead = len - firstChunk;  
      memcpy(&bufferSerialRead[0], data + firstChunk, _writerSerialRead);
    }
    else {
      memcpy(&bufferSerialRead[_writerSerialRead], data, len);
      _writerSerialRead += len;
      if (_writerSerialRead == FIFO_SIZE_READ_SERIAL) _writerSerialRead = 0;
    }
    lenBufferSerialRead += len;
  }
  else {
    _overflow_bufferSerialRead = true;
    // TODO: gestire overflow
    //Serial.println("Overflow nello scrivere nel BUFFER lettura del SERIAL BUFFER");
  }
}

int SerialWireless_::availablePacket() {
  return numAvailablePacket;
}


void SerialWireless_::init_wireless() {
  configST myConfig; // variabile di utilità per configurazione
  // ============ inizializzazione semafori =============
  tx_sem = xSemaphoreCreateBinary();
  mutex_tx_serial = xSemaphoreCreateMutex();
  mutex_writer_bin = xSemaphoreCreateMutex();

  xSemaphoreGive(tx_sem);
  xSemaphoreGive(mutex_tx_serial);
  xSemaphoreGive(mutex_writer_bin);
  // ==== fine inizializzazione semafori

  myConfig.port         = &Serial; // questo andrà tolta - rimasta solo per contabilità =========================================
  myConfig.debug        = false; //true; //false; //true;
  myConfig.debugPort    = &Serial;
  myConfig.timeout      = DEFAULT_TIMEOUT; // 50ms
  myConfig.callbacks    = callbackArr;
  //myConfig.callbacks    = NULL;
  myConfig.callbacksLen = sizeof(callbackArr) / sizeof(functionPtr);
  //myConfig.callbacksLen = 0;
  packet.begin(myConfig);

  setupTimer(); // crea i timer .. timer per invio dati seriali

}


void SerialWireless_::begin() {
  #ifdef COMMENTO
  configST myConfig; // variabile di utilità per configurazione
  // ============ inizializzazione semafori =============
  tx_sem = xSemaphoreCreateBinary();
  mutex_tx_serial = xSemaphoreCreateMutex();
  mutex_writer_bin = xSemaphoreCreateMutex();

  xSemaphoreGive(tx_sem);
  xSemaphoreGive(mutex_tx_serial);
  xSemaphoreGive(mutex_writer_bin);
  // ==== fine inizializzazione semafori
  #endif //COMMENTO

  #ifdef GUN
  if (lastDongleSave) espnow_wifi_channel=lastDongleChannel;
    else espnow_wifi_channel = findBestChannel(); //12;
  //findBestChannel();
  #endif //GUN

  WiFi.mode(WIFI_STA); 
  
